import { AchievementId } from 'entities/achievement';

const ACHIEVEMENT_ITEM_TEXTS_RU: Record<AchievementId, { name: string; description: string }> = {
  [1]: {
    name: 'Достижение достижение 1',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [2]: {
    name: 'Достижение достижение 2',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [3]: {
    name: 'Достижение достижение 3',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [4]: {
    name: 'Достижение достижение 4',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [5]: {
    name: 'Достижение достижение 5',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [6]: {
    name: 'Достижение достижение 6',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [7]: {
    name: 'Достижение достижение 7',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [8]: {
    name: 'Достижение достижение 8',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [9]: {
    name: 'Достижение достижение 9',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [10]: {
    name: 'Достижение достижение 10',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [11]: {
    name: 'Достижение достижение 11',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [12]: {
    name: 'Достижение достижение 12',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [13]: {
    name: 'Достижение достижение 13',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [14]: {
    name: 'Достижение достижение 14',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [15]: {
    name: 'Достижение достижение 15',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [16]: {
    name: 'Достижение достижение 16',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [17]: {
    name: 'Достижение достижение 17',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
  [18]: {
    name: 'Достижение достижение 18',
    description:
      'В рамках спецификации современных стандартов, многие известные личности являются только методом политического участия и смешаны',
  },
};

export const ACHIEVEMENT_TEXTS_RU = {
  achievementItems: ACHIEVEMENT_ITEM_TEXTS_RU,
};
