export const setPseudoClassElementT = () => ({
  tableImageAlt: 'Изображение стола',
  letter: {
    p1: 'Друзья мои верные,',
    p2: 'Отправляюсь я\xa0в\xa0опасное путешествие, чтобы сразиться с\xa0драконом. Верю, что с\xa0помощью следующих вещей я\xa0одержу победу:',
    list: {
      item1: 'Острый меч, зачарованный против зла;',
      item2: 'Магический амулет, дарующий мне\xa0силу и\xa0стойкость;',
      item3: 'Лекарственные травы на\xa0случай ранений;',
    },
    p3: 'Ждите моего возвращения, и\xa0мы\xa0обязательно отметим мою\xa0победу пиршеством!',
    p4: 'С\xa0верностью и\xa0дружбой,',
    p5: 'Ваш\xa0рыцарь',
  },
});
